# HookLength0 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendData..::..HookLength0 Property
RebarBendData Class See Also
---
The extension length of the hook at the start.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double HookLength0 { get; set; }
```

Visual Basic
---
```text
Public Property HookLength0 As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double HookLength0 {
	double get ();
	void set (double value);
}
```

# See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace